НВ_Доработки/Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияТоваровИУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

НВ_Доработки/AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

НВ_Доработки/Documents/РеализацияТоваровИУслуг/Ext/ObjectModule.bsl
&Перед("ОбработкаПроведения")
Процедура НВД_ОбработкаПроведения(Отказ, РежимПроведения)
	//Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") И НЕ Основание.Пустая() Тогда
	//	ИзменитьСтатусДокументовРезервирование();			
	//КонецЕсли;
КонецПроцедуры

&Перед("ОбработкаУдаленияПроведения")
Процедура НВД_ОбработкаУдаленияПроведения(Отказ)
	//ИзменитьСтатусДокументовРезервированиеПриОтменеПроведения();
КонецПроцедуры

Процедура ИзменитьСтатусДокументовРезервирование() 
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	СписокТоваров = Товары.Выгрузить();
	СписокТоваров.Очистить();
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		Если Не ТипЗнч(ТекущаяСтрока.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") И Не ЗначениеЗаполнено(ТекущаяСтрока.Заказ) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = СписокТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);			
		НоваяСтрока.Количество = НоваяСтрока.Количество * НоваяСтрока.Коэффициент;
		
	КонецЦикла;
	
	СписокТоваров.Колонки.Добавить("ВидТабличнойЧасти", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТабличнойЧасти"));
	СписокТоваров.ЗаполнитьЗначения(Перечисления.ВидыТабличнойЧасти.Товары, "ВидТабличнойЧасти");
	
	СписокТоваров.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	СписокТоваров.ЗаполнитьЗначения(Склад, "Склад");
	
	СписокТоваров.Свернуть("Склад, ВидТабличнойЧасти, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, Заказ", "Количество");
	
	МоментВремени = Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая);
	
	ТЗСписанныеРезервы = РегистрыНакопления.ТоварыВРезервеНаСкладах.НВД_ПолучитьОстаткиПоРезервамНамоментВремени(МоментВремени, СписокТоваров, ОрганизацияТоваров);  
	
	ТЗСписанныеРезервы.Колонки.Добавить("Количество");
	
	ТЗСписанныеРезервы.ЗагрузитьКолонку(ТЗСписанныеРезервы.ВыгрузитьКолонку("КоличествоВДокументе"), "Количество");
	
	Если ТЗСписанныеРезервы.Количество() > 0 Тогда 
		
		//ТЗЗаказовПокупателейСписанныхРезервов = ТЗСписанныеРезервы.Скопировать();
		//ТЗЗаказовПокупателейСписанныхРезервов.Свернуть("ДокументРезерва");
		//ДокументыРезерва = ТЗЗаказовПокупателейСписанныхРезервов.ВыгрузитьКолонку("ДокументРезерва");                                                
		
		ВТСписываемыеРезервы = Новый ТаблицаЗначений;
		ВТСписываемыеРезервы.Колонки.Добавить("ДокументРезерва", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
		ВТСписываемыеРезервы.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ВТСписываемыеРезервы.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
		ВТСписываемыеРезервы.Колонки.Добавить("ВидТабличнойЧасти", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТабличнойЧасти"));
		ВТСписываемыеРезервы.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ВТСписываемыеРезервы.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ВТСписываемыеРезервы.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
		ВТСписываемыеРезервы.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
		
		Для Каждого СтрокаТЗСписанныерезервы Из ТЗСписанныеРезервы Цикл
			
			СтрокаТаблицы = ВТСписываемыеРезервы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТЗСписанныерезервы);
			
		КонецЦикла;
		
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ
		|	ВТСписываемыеРезервы.Количество КАК СписываемоеКоличество,
		|	ВТСписываемыеРезервы.ДокументРезерва КАК ДокументРезерва,
		|	ВТСписываемыеРезервы.Склад КАК Склад,
		|	ВТСписываемыеРезервы.Организация КАК Организация,
		|	ВТСписываемыеРезервы.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
		|	ВТСписываемыеРезервы.Номенклатура КАК Номенклатура,
		|	ВТСписываемыеРезервы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТСписываемыеРезервы.СерияНоменклатуры КАК СерияНоменклатуры
		|ПОМЕСТИТЬ ВТЗакрытиеРезервов
		|ИЗ
		|	&ВТСписываемыеРезервы КАК ВТСписываемыеРезервы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ДокументРезерва,
		|	ТоварыВРезервеНаСкладахОстатки.Организация КАК Организация,
		|	ТоварыВРезервеНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыВРезервеНаСкладахОстатки.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
		|	ТоварыВРезервеНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВТЗакрытиеРезервов.СписываемоеКоличество КАК СписываемоеКоличество,
		|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток - ВТЗакрытиеРезервов.СписываемоеКоличество КАК Разница
		|ИЗ
		|	ВТЗакрытиеРезервов КАК ВТЗакрытиеРезервов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&МоментВремени, ) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ТоварыВРезервеНаСкладахОстатки.ДокументРезерва = ВТЗакрытиеРезервов.ДокументРезерва
		|			И (ВТЗакрытиеРезервов.Склад = ТоварыВРезервеНаСкладахОстатки.Склад)
		|			И (ВТЗакрытиеРезервов.Организация = ТоварыВРезервеНаСкладахОстатки.Организация)
		|			И (ВТЗакрытиеРезервов.ВидТабличнойЧасти = ТоварыВРезервеНаСкладахОстатки.ВидТабличнойЧасти)
		|			И (ВТЗакрытиеРезервов.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура)
		|			И (ВТЗакрытиеРезервов.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры)
		|			И (ВТЗакрытиеРезервов.СерияНоменклатуры = ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры)
		|ГДЕ
		|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток - ВТЗакрытиеРезервов.СписываемоеКоличество > 0";
		
		Запрос.Текст = ТекстЗапроса;
		//Запрос.УстановитьПараметр("ДокументыРезерва", ДокументыРезерва);
		
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
		Запрос.УстановитьПараметр("ВТСписываемыеРезервы", ВТСписываемыеРезервы);
		
		ТЗОтклоненийЗарезервированоИСписано = Запрос.Выполнить().Выгрузить(); 
		
		Если ТЗОтклоненийЗарезервированоИСписано.Количество() > 0 Тогда 
			
			ВТРезервыОтклонения = Новый ТаблицаЗначений;
			ВТРезервыОтклонения.Колонки.Добавить("ДокументРезерва", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
			ВТРезервыОтклонения.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
			ВТРезервыОтклонения.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
			ВТРезервыОтклонения.Колонки.Добавить("ВидТабличнойЧасти", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТабличнойЧасти"));
			ВТРезервыОтклонения.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			ВТРезервыОтклонения.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
			ВТРезервыОтклонения.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
			ВТРезервыОтклонения.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
			
			Для Каждого СтрокаТЗОтклоненийЗарезервированоИСписано Из ТЗОтклоненийЗарезервированоИСписано Цикл
				
				СтрокаТаблицы = ВТРезервыОтклонения.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТЗОтклоненийЗарезервированоИСписано);
				
			КонецЦикла;
			Запрос = Новый Запрос;
			ТекстЗапроса = "ВЫБРАТЬ
			|	ВТСписываемыеРезервы.Количество КАК СписываемоеКоличество,
			|	ВТСписываемыеРезервы.ДокументРезерва КАК ДокументРезерва,
			|	ВТСписываемыеРезервы.Склад КАК Склад,
			|	ВТСписываемыеРезервы.Организация КАК Организация,
			|	ВТСписываемыеРезервы.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
			|	ВТСписываемыеРезервы.Номенклатура КАК Номенклатура,
			|	ВТСписываемыеРезервы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ВТСписываемыеРезервы.СерияНоменклатуры КАК СерияНоменклатуры
			|ПОМЕСТИТЬ ВТЗакрытиеРезервов
			|ИЗ
			|	&ВТСписываемыеРезервы КАК ВТСписываемыеРезервы
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТоварыВРезервеНаСкладах.ДокументРезерва КАК ДокументРезерва,
			|	ТоварыВРезервеНаСкладах.Организация КАК Организация,
			|	ТоварыВРезервеНаСкладах.Склад КАК Склад,
			|	ТоварыВРезервеНаСкладах.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
			|	ТоварыВРезервеНаСкладах.Номенклатура КАК Номенклатура,
			|	ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ТоварыВРезервеНаСкладах.СерияНоменклатуры КАК СерияНоменклатуры,
			|	ВТЗакрытиеРезервов.СписываемоеКоличество КАК СписываемоеКоличество,
			|	ТоварыВРезервеНаСкладах.Регистратор КАК Регистратор,
			|	ТоварыВРезервеНаСкладах.Количество КАК Количество
			|ИЗ
			|	ВТЗакрытиеРезервов КАК ВТЗакрытиеРезервов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах КАК ТоварыВРезервеНаСкладах
			|		ПО ТоварыВРезервеНаСкладах.ДокументРезерва = ВТЗакрытиеРезервов.ДокументРезерва
			|			И (ВТЗакрытиеРезервов.Склад = ТоварыВРезервеНаСкладах.Склад)
			|			И (ВТЗакрытиеРезервов.Организация = ТоварыВРезервеНаСкладах.Организация)
			|			И (ВТЗакрытиеРезервов.ВидТабличнойЧасти = ТоварыВРезервеНаСкладах.ВидТабличнойЧасти)
			|			И (ВТЗакрытиеРезервов.Номенклатура = ТоварыВРезервеНаСкладах.Номенклатура)
			|			И (ВТЗакрытиеРезервов.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры)
			|			И (ВТЗакрытиеРезервов.СерияНоменклатуры = ТоварыВРезервеНаСкладах.СерияНоменклатуры)";
			
			Запрос.Текст = ТекстЗапроса;
			//Запрос.УстановитьПараметр("ДокументыРезерва", ДокументыРезерва);
			
			Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
			Запрос.УстановитьПараметр("ВТСписываемыеРезервы", ВТРезервыОтклонения);
			
			ТЗИсключаемыеДокументыРезервирования = Запрос.Выполнить().Выгрузить();
			Если ТЗИсключаемыеДокументыРезервирования.Количество() > 0 Тогда
				МассивИсключаемыхРезервирований = ТЗИсключаемыеДокументыРезервирования.ВыгрузитьКолонку("Регистратор");
			Иначе
				МассивИсключаемыхРезервирований = Новый Массив;
			КонецЕсли;
			
		Иначе
			МассивИсключаемыхРезервирований = Новый Массив;
			
		КонецЕсли;
		
		ВТСписываемыеРезервы = Новый ТаблицаЗначений;
		ВТСписываемыеРезервы.Колонки.Добавить("ДокументРезерва", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
		ВТСписываемыеРезервы.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ВТСписываемыеРезервы.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
		ВТСписываемыеРезервы.Колонки.Добавить("ВидТабличнойЧасти", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТабличнойЧасти"));
		ВТСписываемыеРезервы.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ВТСписываемыеРезервы.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ВТСписываемыеРезервы.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
		ВТСписываемыеРезервы.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
		
		Для Каждого СтрокаТЗСписанныерезервы Из ТЗСписанныеРезервы Цикл
			
			СтрокаТаблицы = ВТСписываемыеРезервы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТЗСписанныерезервы);
			
		КонецЦикла;
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ
		|	ВТСписываемыеРезервы.Количество КАК СписываемоеКоличество,
		|	ВТСписываемыеРезервы.ДокументРезерва КАК ДокументРезерва,
		|	ВТСписываемыеРезервы.Склад КАК Склад,
		|	ВТСписываемыеРезервы.Организация КАК Организация,
		|	ВТСписываемыеРезервы.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
		|	ВТСписываемыеРезервы.Номенклатура КАК Номенклатура,
		|	ВТСписываемыеРезервы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТСписываемыеРезервы.СерияНоменклатуры КАК СерияНоменклатуры
		|ПОМЕСТИТЬ ВТЗакрытиеРезервов
		|ИЗ
		|	&ВТСписываемыеРезервы КАК ВТСписываемыеРезервы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВРезервеНаСкладах.ДокументРезерва КАК ДокументРезерва,
		|	ТоварыВРезервеНаСкладах.Организация КАК Организация,
		|	ТоварыВРезервеНаСкладах.Склад КАК Склад,
		|	ТоварыВРезервеНаСкладах.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
		|	ТоварыВРезервеНаСкладах.Номенклатура КАК Номенклатура,
		|	ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТоварыВРезервеНаСкладах.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ВТЗакрытиеРезервов.СписываемоеКоличество КАК СписываемоеКоличество,
		|	ТоварыВРезервеНаСкладах.Регистратор КАК Регистратор,
		|	ТоварыВРезервеНаСкладах.Количество КАК Количество
		|ИЗ
		|	ВТЗакрытиеРезервов КАК ВТЗакрытиеРезервов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах КАК ТоварыВРезервеНаСкладах
		|		ПО ТоварыВРезервеНаСкладах.ДокументРезерва = ВТЗакрытиеРезервов.ДокументРезерва
		|			И (ВТЗакрытиеРезервов.Склад = ТоварыВРезервеНаСкладах.Склад)
		|			И (ВТЗакрытиеРезервов.Организация = ТоварыВРезервеНаСкладах.Организация)
		|			И (ВТЗакрытиеРезервов.ВидТабличнойЧасти = ТоварыВРезервеНаСкладах.ВидТабличнойЧасти)
		|			И (ВТЗакрытиеРезервов.Номенклатура = ТоварыВРезервеНаСкладах.Номенклатура)
		|			И (ВТЗакрытиеРезервов.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры)
		|			И (ВТЗакрытиеРезервов.СерияНоменклатуры = ТоварыВРезервеНаСкладах.СерияНоменклатуры)";
		
		Запрос.Текст = ТекстЗапроса;
		//Запрос.УстановитьПараметр("ДокументыРезерва", ДокументыРезерва);
		
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
		Запрос.УстановитьПараметр("ВТСписываемыеРезервы", ВТСписываемыеРезервы);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		РезультатЗапроса.Свернуть("Регистратор");
		
		МассивРезервированийДляИзмененияСтатуса =  РезультатЗапроса.ВыгрузитьКолонку("Регистратор");
		
		Для Каждого Резервирование Из МассивРезервированийДляИзмененияСтатуса Цикл
			Если ТипЗнч(Резервирование) = Тип("ДокументСсылка.СнятиеРезервов") ИЛИ 
				(ТипЗнч(Резервирование) = Тип("ДокументСсылка.Резервирование") И Резервирование.ТекущийСтатус = Справочники.СтатусыРезервирований.Отменен) Тогда
				Продолжить;
			КонецЕсли;
			
			Если МассивИсключаемыхРезервирований.Найти(Резервирование) <> Неопределено Тогда
				ОбщийМодульВызовСервера.НВД_ИзменитьСтатусДокументаРезервирование(Резервирование, Справочники.СтатусыРезервирований.ВРаботе);
			Иначе
				ОбщийМодульВызовСервера.НВД_ИзменитьСтатусДокументаРезервирование(Резервирование, Справочники.СтатусыРезервирований.Выполнен);
			КонецЕсли;		
		КонецЦикла;	
		
	КонецЕсли;
КонецПроцедуры	

Процедура ИзменитьСтатусДокументовРезервированиеПриОтменеПроведения()
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	СписокТоваров = Товары.Выгрузить();
	СписокТоваров.Очистить();
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		Если Не ТипЗнч(ТекущаяСтрока.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") И Не ЗначениеЗаполнено(ТекущаяСтрока.Заказ) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = СписокТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);			
		НоваяСтрока.Количество = НоваяСтрока.Количество * НоваяСтрока.Коэффициент;
		
	КонецЦикла;
	
	СписокТоваров.Колонки.Добавить("ВидТабличнойЧасти", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТабличнойЧасти"));
	СписокТоваров.ЗаполнитьЗначения(Перечисления.ВидыТабличнойЧасти.Товары, "ВидТабличнойЧасти");
	
	СписокТоваров.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	СписокТоваров.ЗаполнитьЗначения(Склад, "Склад");
	
	СписокТоваров.Свернуть("Склад, ВидТабличнойЧасти, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, Заказ", "Количество");
	
	МоментВремени = Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая);
	
	ТЗСписанныеРезервы = РегистрыНакопления.ТоварыВРезервеНаСкладах.НВД_ПолучитьОстаткиПоРезервамНамоментВремени(МоментВремени, СписокТоваров, ОрганизацияТоваров);  
	
	ТЗСписанныеРезервы.Колонки.Добавить("Количество");
	
	ТЗСписанныеРезервы.ЗагрузитьКолонку(ТЗСписанныеРезервы.ВыгрузитьКолонку("КоличествоВДокументе"), "Количество");
	
	Если ТЗСписанныеРезервы.Количество() > 0 Тогда 
		
		//ТЗЗаказовПокупателейСписанныхРезервов = ТЗСписанныеРезервы.Скопировать();
		//ТЗЗаказовПокупателейСписанныхРезервов.Свернуть("ДокументРезерва");
		//ДокументыРезерва = ТЗЗаказовПокупателейСписанныхРезервов.ВыгрузитьКолонку("ДокументРезерва");                                                
		
		ВТСписываемыеРезервы = Новый ТаблицаЗначений;
		ВТСписываемыеРезервы.Колонки.Добавить("ДокументРезерва", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
		ВТСписываемыеРезервы.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ВТСписываемыеРезервы.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
		ВТСписываемыеРезервы.Колонки.Добавить("ВидТабличнойЧасти", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТабличнойЧасти"));
		ВТСписываемыеРезервы.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ВТСписываемыеРезервы.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ВТСписываемыеРезервы.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
		ВТСписываемыеРезервы.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
		
		Для Каждого СтрокаТЗСписанныерезервы Из ТЗСписанныеРезервы Цикл
			
			СтрокаТаблицы = ВТСписываемыеРезервы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТЗСписанныерезервы);
			
		КонецЦикла;
		
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ
		|	ВТСписываемыеРезервы.Количество КАК СписываемоеКоличество,
		|	ВТСписываемыеРезервы.ДокументРезерва КАК ДокументРезерва,
		|	ВТСписываемыеРезервы.Склад КАК Склад,
		|	ВТСписываемыеРезервы.Организация КАК Организация,
		|	ВТСписываемыеРезервы.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
		|	ВТСписываемыеРезервы.Номенклатура КАК Номенклатура,
		|	ВТСписываемыеРезервы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТСписываемыеРезервы.СерияНоменклатуры КАК СерияНоменклатуры
		|ПОМЕСТИТЬ ВТЗакрытиеРезервов
		|ИЗ
		|	&ВТСписываемыеРезервы КАК ВТСписываемыеРезервы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ДокументРезерва,
		|	ТоварыВРезервеНаСкладахОстатки.Организация КАК Организация,
		|	ТоварыВРезервеНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыВРезервеНаСкладахОстатки.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
		|	ТоварыВРезервеНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВТЗакрытиеРезервов.СписываемоеКоличество КАК СписываемоеКоличество,
		|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток - ВТЗакрытиеРезервов.СписываемоеКоличество КАК Разница
		|ИЗ
		|	ВТЗакрытиеРезервов КАК ВТЗакрытиеРезервов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&МоментВремени, ) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ТоварыВРезервеНаСкладахОстатки.ДокументРезерва = ВТЗакрытиеРезервов.ДокументРезерва
		|			И (ВТЗакрытиеРезервов.Склад = ТоварыВРезервеНаСкладахОстатки.Склад)
		|			И (ВТЗакрытиеРезервов.Организация = ТоварыВРезервеНаСкладахОстатки.Организация)
		|			И (ВТЗакрытиеРезервов.ВидТабличнойЧасти = ТоварыВРезервеНаСкладахОстатки.ВидТабличнойЧасти)
		|			И (ВТЗакрытиеРезервов.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура)
		|			И (ВТЗакрытиеРезервов.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры)
		|			И (ВТЗакрытиеРезервов.СерияНоменклатуры = ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры)
		|ГДЕ
		|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток - ВТЗакрытиеРезервов.СписываемоеКоличество <> 0";
		
		Запрос.Текст = ТекстЗапроса;
		//Запрос.УстановитьПараметр("ДокументыРезерва", ДокументыРезерва);
		
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
		Запрос.УстановитьПараметр("ВТСписываемыеРезервы", ВТСписываемыеРезервы);
		
		ТЗОтклоненийЗарезервированоИСписано = Запрос.Выполнить().Выгрузить(); 
		
		Если ТЗОтклоненийЗарезервированоИСписано.Количество() > 0 Тогда 
			
			ВТРезервыОтклонения = Новый ТаблицаЗначений;
			ВТРезервыОтклонения.Колонки.Добавить("ДокументРезерва", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
			ВТРезервыОтклонения.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
			ВТРезервыОтклонения.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
			ВТРезервыОтклонения.Колонки.Добавить("ВидТабличнойЧасти", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТабличнойЧасти"));
			ВТРезервыОтклонения.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			ВТРезервыОтклонения.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
			ВТРезервыОтклонения.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
			ВТРезервыОтклонения.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
			
			Для Каждого СтрокаТЗОтклоненийЗарезервированоИСписано Из ТЗОтклоненийЗарезервированоИСписано Цикл
				
				СтрокаТаблицы = ВТРезервыОтклонения.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТЗОтклоненийЗарезервированоИСписано);
				
			КонецЦикла;
			Запрос = Новый Запрос;
			ТекстЗапроса = "ВЫБРАТЬ
			               |	ВТСписываемыеРезервы.Количество КАК СписываемоеКоличество,
			               |	ВТСписываемыеРезервы.ДокументРезерва КАК ДокументРезерва,
			               |	ВТСписываемыеРезервы.Склад КАК Склад,
			               |	ВТСписываемыеРезервы.Организация КАК Организация,
			               |	ВТСписываемыеРезервы.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
			               |	ВТСписываемыеРезервы.Номенклатура КАК Номенклатура,
			               |	ВТСписываемыеРезервы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			               |	ВТСписываемыеРезервы.СерияНоменклатуры КАК СерияНоменклатуры
			               |ПОМЕСТИТЬ ВТЗакрытиеРезервов
			               |ИЗ
			               |	&ВТСписываемыеРезервы КАК ВТСписываемыеРезервы
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ТоварыВРезервеНаСкладах.ДокументРезерва КАК ДокументРезерва,
			               |	ТоварыВРезервеНаСкладах.Организация КАК Организация,
			               |	ТоварыВРезервеНаСкладах.Склад КАК Склад,
			               |	ТоварыВРезервеНаСкладах.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
			               |	ТоварыВРезервеНаСкладах.Номенклатура КАК Номенклатура,
			               |	ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			               |	ТоварыВРезервеНаСкладах.СерияНоменклатуры КАК СерияНоменклатуры,
			               |	ВТЗакрытиеРезервов.СписываемоеКоличество КАК СписываемоеКоличество,
			               |	ТоварыВРезервеНаСкладах.Регистратор КАК Регистратор,
			               |	ТоварыВРезервеНаСкладах.Количество КАК Количество
			               |ИЗ
			               |	ВТЗакрытиеРезервов КАК ВТЗакрытиеРезервов
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах КАК ТоварыВРезервеНаСкладах
			               |		ПО (ТоварыВРезервеНаСкладах.ДокументРезерва = ВТЗакрытиеРезервов.ДокументРезерва)
			               |			И ВТЗакрытиеРезервов.Склад = ТоварыВРезервеНаСкладах.Склад
			               |			И ВТЗакрытиеРезервов.Организация = ТоварыВРезервеНаСкладах.Организация
			               |			И ВТЗакрытиеРезервов.ВидТабличнойЧасти = ТоварыВРезервеНаСкладах.ВидТабличнойЧасти
			               |			И ВТЗакрытиеРезервов.Номенклатура = ТоварыВРезервеНаСкладах.Номенклатура
			               |			И ВТЗакрытиеРезервов.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры
			               |			И ВТЗакрытиеРезервов.СерияНоменклатуры = ТоварыВРезервеНаСкладах.СерияНоменклатуры
			               |ГДЕ
			               |	ТИПЗНАЧЕНИЯ(ТоварыВРезервеНаСкладах.Регистратор) = ТИП(Документ.Резервирование)";
			
			Запрос.Текст = ТекстЗапроса;
			//Запрос.УстановитьПараметр("ДокументыРезерва", ДокументыРезерва);
			
			Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
			Запрос.УстановитьПараметр("ВТСписываемыеРезервы", ВТРезервыОтклонения);
			
			ТЗИсключаемыеДокументыРезервирования = Запрос.Выполнить().Выгрузить();
			Если ТЗИсключаемыеДокументыРезервирования.Количество() > 0 Тогда
				МассивИсключаемыхРезервирований = ТЗИсключаемыеДокументыРезервирования.ВыгрузитьКолонку("Регистратор");
			Иначе
				МассивИсключаемыхРезервирований = Новый Массив;
			КонецЕсли;
			
		Иначе
			МассивИсключаемыхРезервирований = Новый Массив;
			
		КонецЕсли;
		
		ВТСписываемыеРезервы = Новый ТаблицаЗначений;
		ВТСписываемыеРезервы.Колонки.Добавить("ДокументРезерва", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
		ВТСписываемыеРезервы.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ВТСписываемыеРезервы.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
		ВТСписываемыеРезервы.Колонки.Добавить("ВидТабличнойЧасти", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТабличнойЧасти"));
		ВТСписываемыеРезервы.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ВТСписываемыеРезервы.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ВТСписываемыеРезервы.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
		ВТСписываемыеРезервы.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
		
		Для Каждого СтрокаТЗСписанныерезервы Из ТЗСписанныеРезервы Цикл
			
			СтрокаТаблицы = ВТСписываемыеРезервы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТЗСписанныерезервы);
			
		КонецЦикла;
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВТСписываемыеРезервы.Количество КАК СписываемоеКоличество,
		               |	ВТСписываемыеРезервы.ДокументРезерва КАК ДокументРезерва,
		               |	ВТСписываемыеРезервы.Склад КАК Склад,
		               |	ВТСписываемыеРезервы.Организация КАК Организация,
		               |	ВТСписываемыеРезервы.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
		               |	ВТСписываемыеРезервы.Номенклатура КАК Номенклатура,
		               |	ВТСписываемыеРезервы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	ВТСписываемыеРезервы.СерияНоменклатуры КАК СерияНоменклатуры
		               |ПОМЕСТИТЬ ВТЗакрытиеРезервов
		               |ИЗ
		               |	&ВТСписываемыеРезервы КАК ВТСписываемыеРезервы
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТоварыВРезервеНаСкладах.ДокументРезерва КАК ДокументРезерва,
		               |	ТоварыВРезервеНаСкладах.Организация КАК Организация,
		               |	ТоварыВРезервеНаСкладах.Склад КАК Склад,
		               |	ТоварыВРезервеНаСкладах.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
		               |	ТоварыВРезервеНаСкладах.Номенклатура КАК Номенклатура,
		               |	ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	ТоварыВРезервеНаСкладах.СерияНоменклатуры КАК СерияНоменклатуры,
		               |	ВТЗакрытиеРезервов.СписываемоеКоличество КАК СписываемоеКоличество,
		               |	ТоварыВРезервеНаСкладах.Регистратор КАК Регистратор,
		               |	ТоварыВРезервеНаСкладах.Количество КАК Количество
		               |ИЗ
		               |	ВТЗакрытиеРезервов КАК ВТЗакрытиеРезервов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах КАК ТоварыВРезервеНаСкладах
		               |		ПО (ТоварыВРезервеНаСкладах.ДокументРезерва = ВТЗакрытиеРезервов.ДокументРезерва)
		               |			И ВТЗакрытиеРезервов.Склад = ТоварыВРезервеНаСкладах.Склад
		               |			И ВТЗакрытиеРезервов.Организация = ТоварыВРезервеНаСкладах.Организация
		               |			И ВТЗакрытиеРезервов.ВидТабличнойЧасти = ТоварыВРезервеНаСкладах.ВидТабличнойЧасти
		               |			И ВТЗакрытиеРезервов.Номенклатура = ТоварыВРезервеНаСкладах.Номенклатура
		               |			И ВТЗакрытиеРезервов.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры
		               |			И ВТЗакрытиеРезервов.СерияНоменклатуры = ТоварыВРезервеНаСкладах.СерияНоменклатуры
		               |ГДЕ
		               |	ТИПЗНАЧЕНИЯ(ТоварыВРезервеНаСкладах.Регистратор) = ТИП(Документ.Резервирование)";
		
		Запрос.Текст = ТекстЗапроса;
		//Запрос.УстановитьПараметр("ДокументыРезерва", ДокументыРезерва);
		
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
		Запрос.УстановитьПараметр("ВТСписываемыеРезервы", ВТСписываемыеРезервы);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		МассивРезервированийДляИзмененияСтатуса =  РезультатЗапроса.ВыгрузитьКолонку("Регистратор");
		
		Для Каждого Резервирование Из МассивРезервированийДляИзмененияСтатуса Цикл
			Если МассивИсключаемыхРезервирований.Найти(Резервирование) <> Неопределено Тогда
				ОбщийМодульВызовСервера.НВД_ИзменитьСтатусДокументаРезервирование(Резервирование, Справочники.СтатусыРезервирований.ВРаботе);
			Иначе
				ОбщийМодульВызовСервера.НВД_ИзменитьСтатусДокументаРезервирование(Резервирование, Справочники.СтатусыРезервирований.ВРаботе);
			КонецЕсли;		
		КонецЦикла;	
		
	КонецЕсли;
КонецПроцедуры
